In [1]:
"Python for Data Ananlysis \
Chapet 5 : Getting Started with pandas"

'Python for Data Ananlysis Chapet 5 : Getting Started with pandas'

In [2]:
"""
Pandas is designed for working with tabular or heterogeneous data.

"""

import pandas as pd; from pandas import Series, DataFrame; import numpy as np

In [3]:
"""
# Series a 1D array-like object containing a sequence of values (similar to NymPy types)
and and associated array of data labels, called its index.
The simplest Series is formed from only an array of data

"""


obj = pd.Series([2,4,5,-2,3])

display(obj)

# Creating a Series with an Index

index_obj = pd.Series([5, 6, 3, 4], index=['a','r','s','c'])

display(index_obj)

# You can use labels in the index when selecting single values or set values:

display(index_obj['a'])

index_obj['c'] = 4

display(index_obj['c'])


# Here ['a','c','r'] is interpreted as a list of indices,
#even though it cointains strings instead of integers.
display(index_obj[['a','c','r']])


# Using NumPy-like operations, such as filtering with aboolean array,

# scalar multiplication, or applying math functions, will perserve the index-value link

display(index_obj[index_obj > 1])

display(index_obj * 3)

0    2
1    4
2    5
3   -2
4    3
dtype: int64

a    5
r    6
s    3
c    4
dtype: int64

5

4

a    5
c    4
r    6
dtype: int64

a    5
r    6
s    3
c    4
dtype: int64

a    15
r    18
s     9
c    12
dtype: int64

In [4]:
"""
Another way to use a Series is as a fixed-legth, ordered dict, as it is a mapping of index values
to data values. It can be used in many ways in many contexts where you migth use a dict
"""

'b' in index_obj

# If you have data in a Py dict, you can create A series from it bu passing the dict

statesNdict = {'ohio' : 35000, 'Texas' : 71000, 'Oregon': 10000, 'Utah' : 50000}

statesNdict2= {'Conocrd' : 35000, 'Texas' : 71000, 'Oregon': 10000, 'Marco' : 50000}

obj3 = pd.Series(statesNdict)

obj2= pd.Series(statesNdict2)

#isplay(statesNdict)

# A useful Series feature for many applicatios is 
# that it automatically aligns by index label in arithmetic operations.

obj3+ obj2

Conocrd         NaN
Marco           NaN
Oregon      20000.0
Texas      142000.0
Utah            NaN
ohio            NaN
dtype: float64

In [5]:
"""
Both the Series object itself and its index have a name attribute, which integrates with other key
areas of pandas fuctionality:
"""

obj3.name = 'population'
obj3.index.name = 'state'

# A Series's index can be altered in-place by assignment:

obj.index = ['Kav', 'Ant', 'Russ','Jeff', 'JV']

obj

Kav     2
Ant     4
Russ    5
Jeff   -2
JV      3
dtype: int64

In [6]:
"""

# DataFrame 
A rectangular table of data and contains an ordered collections of columns, each of which can be a 
different value type(numeric, string, boolean). The DataFrame had both a row and column index;
it can be thougth of as a dict of Series all sharing the same index.
One can use DF to represent higher DIMs data in a tabular format using hierarchial indexing.
"""

# Creating a DF from a dict of equal-leght lists or NumPy arrays:

df_Style = {'state':['Ohio', 'Nevada', 'New York', 'Kansas', 'Texas'],
            'year' : [2019, 2020, 2021, 2022, 2023], 
            'value': [1.5, 2.6, 1.9, 9.4, 2.1]}
    
frame = pd.DataFrame(df_Style)

display(frame)

# If you specify a sequence of columns, the DataFrames columns will be arranged in that order

pd.DataFrame(df_Style, columns=['value', 'state', 'year'])

# A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute

display(frame['year'])

# frame.column only works when the column name is a valid Py variable name.

(frame.year)

# Note that the returned Series have the same index as the DF,
# and their name attribute has been appropriately set.

# Rows can aslo be retruved by position on name with special attribute loc

display(frame.loc[2])

# Columns can be modified and added by assigment. for example,
# the 'debt' column could be created and its value assigned a scalar valu3
frame['Todday'] = [5, 4, 3, 2, 1]

display(frame)


frame['tomorrow'] = np.arange(5,)

display(frame)


# When assinging lists | arrays to a column the value's length must match the length of the DF
# If assingn a Series its labels will be realigned exactly to the DF index, inserting NaN values in any hole.


vid = pd.Series([-5.9, -4.2, -6.8], index=['two', 'four', 'five'])

frame['debt'] = vid

display(frame)

# The del keyword will delete columns as with a dict.

frame['east'] = frame.state == 'Ohio'

display(frame)

del frame['east']

display(frame.columns)

# The column returned from indexing a DF is a view on the underlying data, not a copy! 

# The column can be copied with copy method

      state  year  value
0      Ohio  2019    1.5
1    Nevada  2020    2.6
2  New York  2021    1.9
3    Kansas  2022    9.4
4     Texas  2023    2.1

0    2019
1    2020
2    2021
3    2022
4    2023
Name: year, dtype: int64

state    New York
year         2021
value         1.9
Name: 2, dtype: object

      state  year  value  Todday
0      Ohio  2019    1.5       5
1    Nevada  2020    2.6       4
2  New York  2021    1.9       3
3    Kansas  2022    9.4       2
4     Texas  2023    2.1       1

      state  year  value  Todday  tomorrow
0      Ohio  2019    1.5       5         0
1    Nevada  2020    2.6       4         1
2  New York  2021    1.9       3         2
3    Kansas  2022    9.4       2         3
4     Texas  2023    2.1       1         4

      state  year  value  Todday  tomorrow  debt
0      Ohio  2019    1.5       5         0   NaN
1    Nevada  2020    2.6       4         1   NaN
2  New York  2021    1.9       3         2   NaN
3    Kansas  2022    9.4       2         3   NaN
4     Texas  2023    2.1       1         4   NaN

      state  year  value  Todday  tomorrow  debt   east
0      Ohio  2019    1.5       5         0   NaN   True
1    Nevada  2020    2.6       4         1   NaN  False
2  New York  2021    1.9       3         2   NaN  False
3    Kansas  2022    9.4       2         3   NaN  False
4     Texas  2023    2.1       1         4   NaN  False

Index(['state', 'year', 'value', 'Todday', 'tomorrow', 'debt'], dtype='object')

In [7]:
"""
Another common form of data is a nested dicts of dicts:

If the nested dict is padded to the DF,
pandas will interpret the outer dict keys as the colums and the inner keys as the row indices:
"""

dict_pop = {'Nevada' : {2001: 2.4, 2002: 2.9},
           "Ohio" :{2000: 1.5, 2001:1.7, 2002: 3.6}}  

dict_frame = pd.DataFrame(dict_pop)

# You can transpose the df (swap rows and columns) with similar syntax to a NumPy array

display(dict_frame.T)

# The keys in the inner dicts are comnined and sorted to form the index in the result.
# This isnt true if an explicit index is specified:

display(pd.DataFrame(dict_pop, index=[2001, 2019, 2022]))

dict_frame.loc[2001]

# Dicts of Series are treated in much the same way:

pdata = {'Ohio': dict_frame['Ohio'][:-1],
        'Nevada': dict_frame['Nevada'][:2]}

display(pdata)

pd.DataFrame(pdata)

#  IF a DF index and colums have their name attrinutes set, these will also be displayed

dict_frame.index.name = 'year'; dict_frame.columns.name = 'state'

display(dict_frame)

# Possible data inputs to DF constructor pages 136

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

      Nevada  Ohio
2001     2.4   1.7
2019     NaN   NaN
2022     NaN   NaN

{'Ohio': 2001    1.7
 2002    3.6
 Name: Ohio, dtype: float64,
 'Nevada': 2001    2.4
 2002    2.9
 Name: Nevada, dtype: float64}

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [8]:
"""
# Index Objects

Pandas Index objects are resposible for holding the axis labels and other metadata
(like the axis name or names).
Any array or other sequence of labels you use when constructing
a Series or DataFrame is internallyconverted to an index:


Some users will not often take advantage of the capabilites provided by indexes

"""

obk = pd.Series(range(3), index=['a', 'b', 'c'])

index = obk.index

display(index)

display(index[1:])

# Index objects are immutable and thus can't be modified by the user
# Immutability makes it safer to share index objectys among data structures.

inx_labels = pd.Index(np.arange(3))

display(inx_labels)

obk2 = pd.Series([1.5, -2.5, 0], index=inx_labels)

display(obk2)

obk2.index is inx_labels

# In addition to being array-like, an Index also bahves like a fixed-size set:

display(dict_frame)

display(dict_frame.columns)

display('Ohio' in dict_frame.columns)

display(2004 in dict_frame.index)

# Unlike Py sets pandas Index can cointain duplicate labelss:

dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

display(dup_labels)

# Some Index methods and properties page 138

Index(['a', 'b', 'c'], dtype='object')

Index(['b', 'c'], dtype='object')

Int64Index([0, 1, 2], dtype='int64')

0    1.5
1   -2.5
2    0.0
dtype: float64

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

Index(['Nevada', 'Ohio'], dtype='object', name='state')

True

False

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [9]:
"""
Essential Functionality 
In this section youll learn the fundamaental mechanics of interacting with the data inside a Series or DataFrame  

"""

essiantial_obj  = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

display(essiantial_obj)

display(essiantial_obj.reindex(['a', 'b', 'c', 'd', 'e']))

fill_obj = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

display(fill_obj)

essencial_df = pd.DataFrame(np.arange(9).reshape((3,3)), 
                           index=['a','b','c'],
                           columns=['Ohio', 'Texas', 'California'])

display(essencial_df)

essencial_df_2 = essencial_df.reindex(['a', 'b', 'c', 'd'])

display(essencial_df_2)

# columns can be reindexed with the columns keyword

states = ['Texas', 'Utah', 'California']

display(essencial_df_2.reindex(columns=states))

#display(essencial_df_2.loc[['a', 'b', 'c'], states])

# Reindex fucntion argumetns page 140

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

0      blue
2    purple
4    yellow
dtype: object

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

   Texas  Utah  California
a    1.0   NaN         2.0
b    4.0   NaN         5.0
c    7.0   NaN         8.0
d    NaN   NaN         NaN

In [10]:
"""
Dropping entries from an axis

Dropping one or more entries from an axis is easy if you already have an arrat or list without those entries.
drop method will return a new object with the indicated values deleted ftom an axis.

"""

ax_obj = pd.Series(np.arange(5.), index=['a', 'b','c', 'd', 'e'])

display(ax_obj)

new_obj = ax_obj.drop('c')

display(new_obj)

display(new_obj.drop(['a', 'b']))

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

d    3.0
e    4.0
dtype: float64

In [11]:
# WIth dataframe, index values can be deleted from either axis

index_data = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

display(index_data)

# calling drop with a sequence of labels will drop the values from the row labels (axis 0)

display(index_data.drop(['Colorado', 'Ohio']))

# Drop values from the columns by passing axis=1 or axis='columns'

display(index_data.drop('two', axis=1))

display(index_data.drop(['two', 'four'], axis='columns'))

# Many functions, which modify the size or shape of a Series of DataFrame can manipulate an object in place 
# Not returning a new object

index_data.drop('Colorado', inplace=True)
display(index_data)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [12]:
"""
# Indexing, Selection, and Filtering 

Series Indexing (obj[...]) works analogously to NumPy array indexing, exepct you can use the Series's index values instead of only integers.
Here are some examples
"""

ser_inx_obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

display(ser_inx_obj['b'])

display(ser_inx_obj[1])

display(ser_inx_obj[2:4])

display(ser_inx_obj[['b', 'c', 'd']])

display(ser_inx_obj[[1,2]])

display(ser_inx_obj[ser_inx_obj < 2])

# Slicing with labels is differently than normal Python slicing in that the end point is enclusive

display(ser_inx_obj['b':'c'])

# Setting using these methods modifies the corresponding section of the Series

ser_inx_obj['b':'c'] = 5

display(ser_inx_obj)

1.0

1.0

c    2.0
d    3.0
dtype: float64

b    1.0
c    2.0
d    3.0
dtype: float64

b    1.0
c    2.0
dtype: float64

a    0.0
b    1.0
dtype: float64

b    1.0
c    2.0
dtype: float64

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [13]:
# Indexing into a Dataframe is for retrieving one or more columns either witha single value or sequence 

index_data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                          index=['Ohio', 'Colorado', 'Utah', 'New York'],
                          columns=['one', 'two','three', 'four'])

display(index_data)

display(index_data['two'])

display(index_data[['three', 'one']])

# Indexing like this has a few special cases. First, slicing or selecting data with a boolean array:

display(index_data[:2])

display(index_data[index_data['three'] > 5 ])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [14]:
"""
The row selectionm syntax data[:2] is provided as a convinience.
Passing a sinle element or list to the operator selects the columns.

Another use case is in indexing with a boolean DataFrame,
such as one produced by a scalar comparison:
"""
display(index_data < 5)

index_data[index_data < 5] = 0

display(index_data)

# This the dataframe syntactically more like a two-d NumPy array in thsi case

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
"""
# Selection with loc and iloc 

For DataFrame label-indexing on the rows, [loc and iloc]. 
They enable you to select a subset of the rows and columns from a DataFrame
with NumPy-like notation using either axis labels (loc) or integers (iloc)
"""

# Let's select a singal row and multiplt columns by label:

display(index_data.loc['Colorado', ['two', 'three']])

# Perform some similar selctions with integers using iloc:

display(index_data.iloc[2, [3, 0, 1]])

display(index_data.iloc[2])

display(index_data.iloc[[1 ,2], [3, 0, 1]])

#Both indexing fucntions work with slices n additon to sinle labels or lists of labels

display(index_data.loc[:'Utah', 'two'])

display(index_data.iloc[:, :3][index_data > 5])

# Indexing options with DataFrame vpage 146 147

two      5
three    6
Name: Colorado, dtype: int32

four    11
one      8
two      9
Name: Utah, dtype: int32

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

          four  one  two
Colorado     7    0    5
Utah        11    8    9

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

           one   two  three
Ohio       NaN   NaN    NaN
Colorado   NaN   NaN    6.0
Utah       8.0   9.0   10.0
New York  12.0  13.0   14.0

In [30]:
"""
# Arithmetic and Data Aligment

An important feature for some applications is the behavior of the arithmetic between objects with different indexes.

When you are adding together objects, if any index pairs are not the same,
the respective index in the result will be the union of the index pairs.
For users with database experience, this is similar to an automatic outer join on the index labels,
"""

s1 = pd.Series([7.3, -2.5, 3.4, 1.5],
               index=['a','b','c','d'])

s2 = pd.Series([-2.1, 3, -1.5, 4, 3.1], 
              index=['a', 'c', 'e', 'f', 'g'])

display(s1)

display(s2)

display(s1 + s2)

# The internal data alignment introduces missing values in the label locations that don't overlap.
# Missing values will then propagate in further atithmetic computations.


# In case of a dataframe, alignment is performed on both the roes and the columns.

df1 = pd.DataFrame(np.arange(9,).reshape((3,3)), columns=list('bcd'),
                  index=['Ohio', 'Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12,).reshape((4, 3)), columns=list('bde'), 
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

display(df1)

display(df2)

In [30]:
"""
Adding these returns a Dataframe whose index and columns aare unions of the ones in each DF.

Since the 'c' and 'e' columns are not found in both dataframes objects.

They appear as all missing in the result. 
Same for the rows whose labels are not common to both objects.
"""
display(df1 + df2)

# Adding DF Objects with no column or row label in common, the result will be all nulls,

a    7.3
b   -2.5
c    3.4
d    1.5
dtype: float64

a   -2.1
c    3.0
e   -1.5
f    4.0
g    3.1
dtype: float64

a    5.2
b    NaN
c    6.4
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [53]:
"""
# Arithmetic methods with fill values

In arithmetic operations between diffrently indexed objects,
you might want to fill with a special value, like 0,
when an axis label is one object but not the other:
"""

df11 = pd.DataFrame(np.arange(12,).reshape((3,4)), columns=list('abcd'))


df12 = pd.DataFrame(np.arange(20,).reshape((4,5)), columns=list('abcde'))


df12.loc[1, 'b'] = np.nan

# Adding these two together results in NA values in the locations that dont overlap:

display(df11 + df12)

# Using the add method on df 11, pass df12 and an argument to fillvalue:

df11.add(df12, fill_value=0)

# When reindexing a Series or df, you can also specify a diffrent fill value. 

df11.reindex(columns=df12.columns, fill_value=0)

# Table of Flexible arithmetic methods page 152

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [64]:
"""
# Operations between DF and Series 

As with np arrays of different dimensions, arithmetic between df and series is also defined .
First, as a motivating example,
consider the difference between a two-dimentional array and one of its rows:
"""
world_arr = np.arange(12.).reshape((3,4))

display(world_arr)

display(world_arr[0])

# When subtracting arr[0] from arr, the subtraction is performed once for each row. 

display(world_arr - world_arr[0])

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

array([0., 1., 2., 3.])

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [77]:
"""
This is referred to as broadcasting-- see Appendix A.
Operations betweeen a DataFrame and a Series are similar:
"""

frame = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

series = frame.iloc[0]

display(frame)

display(series)

# arithmetic between DF and Series matches the index of the Series on the Df columns, broadcasting down the rows

display(frame - series)

# If an index value is not found in either the df columns | the Series's index.
# The object is reindexed fo form the Union.

series202 = pd.Series(range(3), index=['b', ' e', 'f'])

display(frame + series202)

# If you want to instead broadcast over the columns, 
# matching on the rows, you have to use one of the arithmetic methods

series33 = frame['d']

display(series33)

# The axis num that you pass is the axis to match on. Here we match on the df rows index
# (axis='index' or axis=0) and broadcast across.

display(frame.sub(series33, axis='index'))

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

         e    b   d   e   f
Utah   NaN  0.0 NaN NaN NaN
Ohio   NaN  3.0 NaN NaN NaN
Texas  NaN  6.0 NaN NaN NaN
Oregon NaN  9.0 NaN NaN NaN

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [88]:
"""
# Fucntion Application and Mapping 
NumPy ufuncs (elemnt-wise array methods) also work with pandas objects:

"""

q_frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

display(q_frame)

display(np.abs(q_frame))

               b         d         e
Utah    1.482558  0.662568 -0.152925
Ohio    1.743039  0.593036  0.048517
Texas  -1.988188 -0.191254 -0.596459
Oregon -0.772212 -1.322322  0.700260

               b         d         e
Utah    1.482558  0.662568  0.152925
Ohio    1.743039  0.593036  0.048517
Texas   1.988188  0.191254  0.596459
Oregon  0.772212  1.322322  0.700260

In [89]:
"""
Another frequent operation is applying na fucntion on one-dimensional arrays to each column or row.
DataFrame's apply method does exavtly this:
"""
f = lambda x: x.max() - x.min()

q_frame.apply(f)

b    3.731227
d    1.984890
e    1.296720
dtype: float64

In [91]:
"""
Here the fucntion f, which computes the difference between the maximum and minimum of a Series,
is invoked once on each column in frame. The result is a series having the columns of frame as its index.

If you pass axis='columns' to apply, the function will be invoked once per row instead:
"""
display(q_frame.apply(f, axis='columns'))

In [95]:
"""
Many of the most common array statistics (like sum and mean) are df methods, using apply is not needed.
The fucntion passed to appy need not reaturn a scalar value:
it can also return a Series with multiple values:

Element-wise Python functions can be used, too.Suppose you wanted to compute a formatted string from each 
floating-point value in the frame. You can do this with apply map:
"""


format = lambda x: '%.2f' % x

display(q_frame.applymap(format))

# The reason for the name applymap is that Series has a map method for applying an element-wise function

display(q_frame['e'].map(format))

            b      d      e
Utah     1.48   0.66  -0.15
Ohio     1.74   0.59   0.05
Texas   -1.99  -0.19  -0.60
Oregon  -0.77  -1.32   0.70

Utah      -0.15
Ohio       0.05
Texas     -0.60
Oregon     0.70
Name: e, dtype: object